{
  "locale": "sp",
  "strings": {
    "title": "Aplicación Guía de la Aldea Nanliao",
    
    "setting_page": {
      "title": "Configuración",
      "general": "General",
      "language": "Idioma",
      "clean_cache": "Limpiar caché",
      "clean_cache_title": "Limpiar caché de audio",
      "clean_cache_message": "Se eliminarán los archivos de audio descargados. Será necesario volver a descargarlos en la próxima reproducción",
      "clean_cache_success": "Se eliminaron {count} archivos",
      "clean_cache_fail": "Error al limpiar caché",
      "clean_cache_empty": "No hay archivos en caché",
      "cancel": "Cancelar",
      "confirm": "Confirmar",
      "about": "Acerca de",
      "app_name": "Versión de la aplicación guía de turismo",
      "version": "v1.0.0",
      "lang_saved": "Idioma guardado"
    },

    "home_page": {
      "welcome": "Bienvenido a la aplicación guía de la comunidad Nanliao",
      "description": "Esta es una aplicación guía específica para la comunidad Nanliao que ofrece varios menús de funciones para que los usuarios elijan.",
      "menu_title": "Menú de puntos guía",
      "war_games_room": "Sala de juegos de guerra"
    },

    "text_size": {
      "title": "Control de tamaño de texto",
      "now": "Tamaño actual",
      "zoom_in": "Ampliar",
      "zoom_out": "Reducir",
      "reset": "Restablecer"
    },

    "target_focus": {
      "menu": "¡El menú aquí se puede deslizar para ver más atracciones!",
      "change_button": "Haz clic aquí para cambiar la forma de mostrar los puntos guía.",
      "setting": "Haz clic aquí para entrar en la página de configuración.",
      "qr": "¡La función de escaneo de código QR está aquí!",
      "back_home": "Puedes hacer clic aquí para volver rápidamente al inicio~",
      "guide": "¡Haz clic aquí para ver las instrucciones de ayuda nuevamente!",
      "skip": "Omitir"
    },

    "tutorial": {
      "image_carousel": "🖼️ Carrusel automático de imágenes, haz clic para ampliar/reducir",
      "audio_player": "🎵 Función de reproducción de audio",
      "text_control": "📝 Control de tamaño de texto"
    },

    "image": {
      "load_failed": "Error al cargar la imagen",
      "close": "Cerrar",
      "no_image": "No hay imagen para mostrar",
      "previous": "Anterior",
      "next": "Siguiente"
    },

    "audio": {
      "skip_forward": "Avanzar 5 segundos",
      "skip_backward": "Retroceder 5 segundos",
      "restart": "Reproducir de nuevo",
      "speed_normal": "Velocidad normal 1.0x",
      "speed_fast": "Reproducción rápida 1.25x",
      "speed_faster": "Reproducción de alta velocidad 1.5x",
      "file_not_found": "No se encontró el archivo de audio",
      "play_failed": "Error en la reproducción"
    },

    "loading": {
      "preparing": "Preparando recursos de idioma...",
      "downloading": "Descargando paquete de voz {current} / {total}",
      "completed": "Descarga de paquete de voz completada",
      "no_need": "No es necesario descargar paquete de voz"
    },

    "qr_page": {
      "title": "Escaneo de código QR",
      "scan_instruction": "Apunta la cámara hacia el código QR para escanearlo",
      "scan_result": "Resultado del escaneo",
      "invalid_qr": "Código QR inválido",
      "scan_error": "Ocurrió un error de escaneo",
      "permission_denied": "Se requiere permiso de cámara para escanear",
      "permission_request": "Por favor permite el uso de la cámara",
      "go_to_settings": "Ir a configuración",
      "scanning": "Escaneando...",
      "scan_success": "Escaneo exitoso",
      "no_camera": "No se encontró cámara disponible"
    },

    "page1": {
      "title": "Memoria del agua",
      "introduce": "Introducción a la visión general de Nanliao",
      "content": "Bienvenidos a la aldea Nanliao, esta tierra posee profundas raíces culturales y más de 400 años de historia. Desde el siglo XVII, Penghu ha sido un importante baluarte marítimo, una vez considerado por la Compañía Holandesa de las Indias Orientales como puerta de entrada a China, pero pronto fue expulsado por las fuerzas de la dinastía Ming. Después de la guerra sino-japonesa de 1895, Penghu fue cedido a Japón por el Tratado de Shimonoseki, experimentando cincuenta años de dominio colonial, antes de avanzar gradualmente hacia la modernización. A diferencia de la prosperidad urbana, Nanliao es un asentamiento típico semi-agrícola y semi-pesquero, donde los residentes han dependido durante generaciones de la tierra, las fuentes de agua y el océano para vivir, mostrando la conexión más directa con la naturaleza. Las paredes de coral, edificios antiguos y fuentes de agua tradicionales visibles por toda la aldea son vestigios dejados por los antepasados, y también razones importantes por las que Nanliao puede convertirse en uno de los 100 principales destinos de turismo verde del mundo. Esperamos mostrar a todos la cultura diversa y vibrante de Penghu a través de la historia de Nanliao."
    },

    "page1_1": {
      "title": "Visión general de Nanliao",
      "introduce": "Introducción a la visión general de Nanliao",
      "content": "Bienvenidos a la aldea Nanliao, esta tierra posee profundas raíces culturales y más de 400 años de historia. Desde el siglo XVII, Penghu ha sido un importante baluarte marítimo, una vez considerado por la Compañía Holandesa de las Indias Orientales como puerta de entrada a China, pero pronto fue expulsado por las fuerzas de la dinastía Ming. Después de la guerra sino-japonesa de 1895, Penghu fue cedido a Japón por el Tratado de Shimonoseki, experimentando cincuenta años de dominio colonial, antes de avanzar gradualmente hacia la modernización. A diferencia de la prosperidad urbana, Nanliao es un asentamiento típico semi-agrícola y semi-pesquero, donde los residentes han dependido durante generaciones de la tierra, las fuentes de agua y el océano para vivir, mostrando la conexión más directa con la naturaleza. Las paredes de coral, edificios antiguos y fuentes de agua tradicionales visibles por toda la aldea son vestigios dejados por los antepasados, y también razones importantes por las que Nanliao puede convertirse en uno de los 100 principales destinos de turismo verde del mundo. Esperamos mostrar a todos la cultura diversa y vibrante de Penghu a través de la historia de Nanliao."
    },

    "page1_2": {
      "title": "Fuente de agua de Nanliao",
      "introduce": "Introducción a la fuente de agua de Nanliao",
      "content": "Ahora estamos de pie en la carretera central que la gente de Nanliao llama 'Calle Zhongzheng', y bajo esta carretera, en realidad está el canal de agua más importante del antiguo Nanliao. La fuente de agua proviene de las tierras altas del Barranco de Tierra Roja al este, fluyendo hacia el noroeste a lo largo de la carretera central hacia el Puerto Kuibi, que era la principal fuente de agua dulce para los aldeanos en el pasado. En tiempos antiguos, los residentes lavaban ropa y procesaban capturas de peces junto al canal de agua, incluso instalaban hornos de pescado, con la vida inextricablemente conectada al agua. La forma de la carretera actual también es una continuación del camino del canal de agua. Este canal de agua de aproximadamente 1.3 kilómetros tenía agua durante todo el año en el pasado, simbolizando las abundantes aguas subterráneas de Nanliao y también contribuyendo a la prosperidad del asentamiento. La leyenda cuenta que el Pozo No. 1 de Nanliao también fue excavado junto al canal de agua bajo la guía de Baosheng Dadi, trayendo una fuente de agua estable a los residentes."
    },

    "page1_3": {
      "title": "Fuente inconclusa",
      "introduce": "Introducción a la fuente inconclusa",
      "content": "Ahora llegamos al Pozo de Agua No. 1 de Nanliao con casi 400 años de historia. El espacio circundante fue renovado por el gobierno del condado en 2024 como imagen de recursos hídricos, instalando figuras de 'Fuente Inconclusa' y 'Saltando al pozo para jugar' para recrear la vida temprana junto al pozo. El pozo está construido con paredes de coral, y las barreras del lado del pozo fueron construidas principalmente por mujeres, demostrando la sabiduría arquitectónica tradicional. También se han preparado piedras de coral cerca, dando la bienvenida a todos a apilarlas con las manos y experimentar la diversión de participar en la construcción del pozo."
    },

    "page1_4": {
      "title": "Saltando al pozo para jugar",
      "introduce": "Introducción a saltando al pozo para jugar",
      "content": "La estatua del niño 'Saltando al pozo para jugar' muestra la escena del pasado donde los niños en verano se quitaban los pantalones a medias, impacientes por saltar al pozo para jugar en el agua. Debido a que los mayores consideraban peligroso ir al mar, los niños de Nanliao principalmente jugaban en los pozos para refrescarse. Los pozos de Nanliao están construidos con coral, con paredes rugosas fáciles de escalar, relativamente seguras. La ropa interior que usaban los niños estaba hecha de sacos de harina de 22 kilogramos del período de ayuda estadounidense, siendo un símbolo de familias relativamente prósperas en ese momento."
    },

    "page1_5": {
      "title": "Paseo por Nanliao",
      "introduce": "Introducción al paseo por Nanliao",
      "content": "Los sitios de paisajes de recursos hídricos de Nanliao están dispersos por toda la aldea. Se recomienda partir del Pozo No. 1, caminar hacia el este a lo largo de la carretera principal, y visitar en secuencia: Casa Antigua Xu Fan, Templo Ancestral de la Familia Zhao, tortuga de boya flotante y complejo de casas antiguas, luego al 'Hoyo de Estiércol de Vaca' que muestra la elaboración de pasteles de estiércol de vaca, y finalmente llegar a la fuente de agua del Barranco de Tierra Roja. En el viaje de regreso, puedes visitar los cuatro pozos antiguos del pueblo, admirar estilos arquitectónicos, y sellar marcas de postales de 'Memoria del Agua' en cada estación como recuerdo de tu viaje."
    },

    "page2": {
      "title": "Horno de pescado Fuji",
      "introduce": "Introducción al horno de pescado Fuji",
      "content": "Construido en el año 48 de la República (1959) por Dai Fuji, el horno de pescado consta de tres partes principales: horno, chimenea y tanque de salmuera. El verano es la temporada de sardinas (comúnmente llamado carne maloliente), y después de que las capturas llegaban a tierra, se cocinaban al vapor en el horno de pescado y se secaban al sol convirtiéndose en pescado seco, exportándose a Taiwán continental y Japón, representando una industria de procesamiento de productos pesqueros que fue extremadamente próspera en Penghu.\nPara permitir que la gente moderna comprenda la industria tradicional de hornos de pescado, la comunidad obtuvo el consentimiento del propietario Zhao Fuqian y propuso un plan de subsidio de construcción espacial para renovación en el año 101 de la República (2012), permitiendo que el aspecto del horno de pescado fuera restaurado."
    },

    "page3": {
      "title": "Casa del árbol de coral",
      "introduce": "Introducción a la casa del árbol de coral",
      "content": "En los primeros años de la República, tres familias vivían en la casa antigua, donde la 'casa principal' era operada como una farmacia de medicina tradicional china por personas de Qingluo. En el pasado, cuando los aldeanos se sentían mal, buscaban el poder de la fe, obtenían recetas médicas de Baosheng Dadi, y tomaban hierbas medicinales para buscar una pronta recuperación; también había una escuela privada que enseñaba literatura china: la 'habitación este' era residencial; la 'habitación oeste' era una barbería operada por gente local. En el año 102 de la República (2013), a través del programa internacional de turismo voluntario, se realizó servicio comunitario, y después de una decoración cuidadosa, la Casa del Árbol de Coral se convirtió en un lugar secreto para explorar la historia."
    },

    "page4": {
      "title": "Casa antigua Xu Fan",
      "introduce": "Introducción a la casa antigua Xu Fan",
      "content": "La casa antigua comenzó a construirse durante el período Xianfeng de la dinastía Qing (1851-1861) con un diseño de un salón principal y cuatro habitaciones laterales, dividida principalmente en casa principal, habitaciones laterales, pabellón y pozo profundo, con entrada estilo trago invertido, y estructura principal siendo una casa típica de Penghu con paredes de coral y enlucido de cal. Fue renovada por Xu Fan en el año 24 de la República (1935), quien había aprendido tempranamente las prácticas taoístas de la secta Lushan en el continente, siendo el maestro fundador de los pequeños rituales del Templo Baoning.\nLa Oficina de Asuntos Culturales del Condado de Penghu la registró como 'Edificio Histórico' por su trasfondo religioso y valor artístico."
    },

    "page5": {
      "title": "Boya flotante giratoria",
      "introduce": "Introducción a la boya flotante giratoria",
      "content": "Esta aldea está ubicada en la esquina noreste de Penghu, y bajo la influencia de los vientos estacionales del noreste, la basura marina de muchos países diferentes se acumula en la costa, creando una enorme carga ambiental para la isla. Zhao Changshou, quien se retiró y regresó a casa, comenzó bajo las circunstancias adecuadas a participar en el trabajo de limpieza de playa, trayendo boyas flotantes utilizables de vuelta a casa. Después de una organización y planificación cuidadosas, creó un nuevo punto con significado ambiental."
    },

    "page6": {
      "title": "Mercado de pequeños agricultores",
      "introduce": "Introducción al mercado de pequeños agricultores",
      "content": "Esta aldea es un asentamiento agrícola tradicional, con maíz en primavera, maní, batatas, calabazas y lufa en verano y otoño, y repollo, nabos, coliflor y zanahorias en invierno.\nEn el año 103 de la República (2014), la comunidad obtuvo el consentimiento del propietario Xu Qipeng y propuso un plan de construcción espacial, a través del trabajo conjunto de los aldeanos, se convirtió en un lugar para que la comunidad ocasionalmente organice mercados de pequeños agricultores, proporcionando a los aldeanos y residentes de comunidades cercanas un lugar para vender sus propias verduras frescas y mariscos de zona intermareal, promoviendo conceptos de agricultura no tóxica y reducción de la huella de carbono alimentaria."
    },

    "page7": {
      "title": "Parque Pollo Madre Perro",
      "introduce": "Introducción al Parque Pollo Madre Perro",
      "content": "Los ancestros de Penghu vivieron en pobreza en tiempos antiguos. Durante el festival del solsticio de invierno, además de hacer bolitas redondas con 'polvo de arroz' como plata del tesoro, los niños casualmente moldeaban varias formas para adorar a ancestros y deidades, evolucionando más tarde para usar 'polvo de arroz' como material, moldeando formas de vacas, ovejas, cerdos, pollos, patos, perros, etc. (comúnmente llamado pollo madre perritos), como ofrendas, orando a los ancestros por bendiciones para ganado próspero y cosechas abundantes en casa; después del culto, los pollo madre perritos también podían servir como bocadillos y juguetes para niños, representando una costumbre importante en la vida folclórica de Penghu durante festivales estacionales.\nEl Gobierno del Condado de Penghu estableció el Parque Pollo Madre Perro aquí para promover y heredar costumbres locales, creando imágenes turísticas culturales únicas."
    },

    "page8": {
      "title": "Templo ancestral de la familia Zhao",
      "introduce": "Introducción al templo ancestral de la familia Zhao",
      "content": "En el año 38 de la República (1949), el Ejército Nacional se estacionó aquí como cuartel. Después de que comenzara la transmisión de Televisión de Taiwán, se equipó con el primer televisor en blanco y negro de la aldea, donde adultos y niños se reunían para ver. Cuando caía la noche, había práctica de danza y canto recreativo de soldados, boxeadores comerciantes vendiendo ungüentos, proyección de películas al aire libre, etc., estas actividades hicieron del templo ancestral el lugar más animado de la aldea. Después de que las tropas se trasladaran, se construyeron nuevamente hornos de pescado en este espacio abierto, con el aroma del pescado llenando el aire y el bullicio de voces. Ahora es el templo ancestral donde los descendientes de Zhao honran respetuosamente a sus antepasados y recuerdan a sus ancestros."
    },

    "page9": {
      "title": "Complejo de casas antiguas de la familia Zhao",
      "introduce": "Introducción al complejo de casas antiguas de la familia Zhao",
      "content": "El complejo de casas antiguas está ubicado entre los números 77-95 de la aldea Nanliao, propiedad de la familia Zhao, con exterior e interior preservando recuerdos de tiempos antiguos. Después de la movilización comunitaria para limpiar, se destacó el estilo arquitectónico sereno y clásico. De pie entre los 'callejones' (callejones de descendientes), uno puede sentir la brisa fresca fluyendo desde la naturaleza, al igual que los descendientes de Nanliao, siempre pueden encontrar los lugares más frescos, tranquilizar la mente y darse un espacio de descanso."
    },

    "page10": {
      "title": "Muro de coral",
      "introduce": "Introducción al muro de coral",
      "content": "Los muros de coral, comúnmente llamados muros de casa, son paisajes especiales de huertos vegetales apilados en Penghu para hacer frente a fuertes vientos estacionales del noreste. La obtención de coral era durante la marea baja, usando 'excavadoras' de seis pies de largo o 'ganchos de ostras' para enganchar arrecifes de coral y usar el principio de palanca para levantarlos del fondo del mar, luego transportarlos a botes de remos humanos o veleros; cuando llegaba la marea alta, se remaban los botes hasta el mar frontal de la aldea, costa del 'cove oeste', usando 'transportadores de cubo' y 'camillas de tabla de madera' para llevar arrecifes de coral hasta la línea de marea alta, luego transportarlos en carreta de buey al sitio de uso para apilar 'huertos vegetales'. Para 'construir casas grandes', el coral necesitaba ser sometido a viento, sol, lluvia y desalinización durante más de dos años antes de poder usarse como material de construcción. Hoy en día, el coral (arrecifes de coral) está protegido y está prohibida su recolección."
    },

    "page11": {
      "title": "Hoyo de estiércol de vaca",
      "introduce": "Introducción al hoyo de estiércol de vaca",
      "content": "El área de experiencia del Hoyo de Estiércol de Vaca recrea la apariencia original de antiguas aldeas rurales. En el año 102 de la República (2013), la comunidad obtuvo el consentimiento del propietario Zhao Yonghuang, a través del subsidio del curso del programa de acompañamiento de regeneración rural de la Oficina de Conservación de Suelos y Agua del Consejo de Agricultura, el ambiente originalmente cubierto de maleza, después de discusión, planificación y organización conjunta de los aldeanos, permitió que los recuerdos de recoger estiércol de vaca y palmear estiércol de vaca reaparecieran, convirtiéndose en un campo de educación ambiental para experiencias."
    },

    "page12": {
      "title": "Agricultor de un día",
      "introduce": "Introducción al agricultor de un día",
      "content": "El área agrícola de esta aldea es bastante extensa, extendiéndose al este hasta Guoye, al oeste hasta Huxi y Hudong, al norte hasta Beiliao, y al sur hasta Jianshan. Los grandes campos distribuidos fuera del asentamiento se llaman 'montañas', mientras que los pequeños jardines cerca de las casas dentro del asentamiento se llaman 'interiores de casa'. En esta tierra, uno puede imaginar las escenas de entonces inclinándose para 'plantar cultivos', guiando bueyes para arar campos, arreglando pequeñas piedras de coral, tejiendo hierba de caña y asando batatas; estas eran escenas de la vida agrícola temprana. Inclínate, agarra un puñado de tierra, y siente la calidez y vitalidad de la tierra."
    },

    "page13": {
      "title": "Granja de experiencia",
      "introduce": "Introducción a la granja de experiencia",
      "content": "El propietario de la granja, Zhao Jiaxie, con una mentalidad amigable con la tierra, adopta métodos de cultivo no tóxicos y orgánicos. En el año 103 de la República (2014), después de pasar la verificación institucional, se convirtió en una granja orgánica. Además de producir verduras y frutas orgánicas, también proporciona visitas turísticas y experiencias agrícolas, con el objetivo final de avanzar hacia paisajes comestibles y agricultura sostenible."
    },

    "page14": {
      "title": "Dama enmascarada",
      "introduce": "Introducción a la dama enmascarada",
      "content": "El tradicional 'paño para envolver pies' de Penghu es un atuendo especial derivado de las mujeres que suben montañas y van al mar para bloquear el sol abrasador y los fríos vientos estacionales del noreste y el rocío salado. Los métodos de envoltura varían en diferentes lugares, la mayoría usando un paño cuadrado de tres pies para envolver la cara; el método de envoltura tradicional local agrega una toalla alrededor de la cara. Debido a que el enmascaramiento es femenino, se llama 'Dama Enmascarada'.\nDebido a su valor cultural de vida especial, la Oficina de Asuntos Culturales del Condado de Penghu la registró como patrimonio cultural intangible."
    },

    "page15": {
      "title": "Bulevar Baosheng",
      "introduce": "Introducción al Bulevar Baosheng",
      "content": "Este es el 'Bulevar Baosheng' que conecta Nanliao y Beiliao, donde los residentes de ambos lugares adoran conjuntamente a Baosheng Dadi. En tiempos antiguos, cuando los ancestros vivían en dificultades, al enfermar o enfrentar problemas, a menudo buscaban lotes de medicina y lotes de fortuna de Baosheng Dadi para orientación. El mural pintado enfrente fue construido para continuar esta fe, y también porque Penghu es ventoso con alto contenido de sal, la pintura puede proteger tanto la superficie del muro como presentar la cultura de poesía de lotes del Templo Baoning. Los colores amarillo, azul, rojo, verde, blanco y negro en el muro están tomados de los colores de las deidades y el sistema de cinco batallones, simbolizando la protección de las cuatro direcciones, y también son las fuentes de color de las banderas de comando durante las procesiones de deidades."
    },

    "feature_1": "Página 1",
    "feature_2": "Página 2",
    "feature_3": "Página 3",
    "feature_4": "Página 4",
    "feature_5": "Página 5",
    "feature_6": "Página 6",
    "feature_7": "Página 7",
    "feature_8": "Página 8",
    "feature_9": "Página 9",
    "feature_10": "Página 10",
    "feature_11": "Página 11",
    "feature_12": "Página 12",
    "feature_13": "Página 13",
    "feature_14": "Página 14",
    "feature_15": "Página 15",
    "feature_16": "Página 16",
    "feature_17": "Página 17",
    "feature_18": "Página 18",
    "feature_19": "Página 19",
    "feature_20": "Círculo de imagen",
    "feature_21": "Escaneo QR",
    
    "back_to_home": "Volver al inicio",
    "current_home": "Actualmente en inicio",
    "settings": "Configuración",

    "map_title": "Mapa",
    "coordinate_point": "Punto de coordenada",
    "coordinates": "Coordenadas",
    "status": "Estado",
    "marked": "Marcado",
    "unmarked": "Sin marcar",
    "close": "Cerrar",
    
    "qr_scanner_title": "Escáner de código QR",
    "scan_instruction": "Apunta la cámara hacia el código QR para escanearlo",
    "scan_result": "Resultado del escaneo:",
    "scan_again": "Escanear de nuevo",
    "open_link": "Abrir enlace",
    "opening": "Abriendo...",
    "copy": "Copiar",
    "copied": "Copiado al portapapeles",
    "copy_failed": "Error al copiar",
    "confirm_open_link": "¿Abrir enlace?",
    "confirm_open_message": "¿Quieres abrir este enlace en el navegador?",
    "cancel": "Cancelar",
    "open": "Abrir",
    "pick_from_gallery": "Elegir de la galería",
    "scan_from_camera": "Escanear con cámara",
    "select_qr_source": "Seleccionar fuente de código QR",
    "processing_image": "Procesando imagen...",
    "no_qr_found": "No se encontró código QR en la imagen",
    "invalid_image": "Formato de imagen inválido",
    "image_too_large": "Imagen demasiado grande, por favor selecciona una imagen más pequeña",

    "cache_messages": {
      "clear_cache_title": "Limpiar caché de audio",
      "clear_cache_content": "¿Estás seguro de que quieres eliminar los archivos de audio descargados? Será necesario volver a descargarlos en la próxima reproducción",
      "clear_cache_cancel": "Cancelar",
      "clear_cache_confirm": "Confirmar limpieza",
      "clear_cache_success": "Se limpiaron {count} archivos de caché",
      "clear_cache_failed": "Error al limpiar caché"
    },

    "app_init": {
      "loading_title": "Cargando...",
      "preparing_resources": "Preparando recursos...",
      "download_progress": "Progreso de descarga {current}/{total}",
      "download_complete": "Descarga completa",
      "initialization_complete": "Inicialización completa"
    },

    "navigation": {
      "home": "Inicio",
      "back": "Atrás",
      "next": "Siguiente",
      "previous": "Anterior",
      "menu": "Menú",
      "more": "Más"
    },

    "common": {
      "error": "Error",
      "warning": "Advertencia",
      "info": "Información",
      "success": "Éxito",
      "loading": "Cargando...",
      "retry": "Reintentar",
      "skip": "Omitir",
      "done": "Hecho",
      "save": "Guardar",
      "delete": "Eliminar",
      "edit": "Editar",
      "search": "Buscar",
      "filter": "Filtrar",
      "sort": "Ordenar",
      "refresh": "Actualizar"
    },

    "permissions": {
      "camera_title": "Permiso de cámara",
      "camera_message": "Esta aplicación necesita permiso de cámara para escanear códigos QR",
      "storage_title": "Permiso de almacenamiento",
      "storage_message": "Esta aplicación necesita permiso de almacenamiento para descargar archivos de audio",
      "microphone_title": "Permiso de micrófono",
      "microphone_message": "Esta aplicación necesita permiso de micrófono para funciones de grabación",
      "location_title": "Permiso de ubicación",
      "location_message": "Esta aplicación necesita permiso de ubicación para proporcionar servicios de localización",
      "grant": "Conceder permiso",
      "deny": "Denegar",
      "settings": "Ir a configuración"
    },

    "errors": {
      "network_error": "Error de conexión de red",
      "file_not_found": "Archivo no encontrado",
      "permission_denied": "Permiso denegado",
      "unknown_error": "Error desconocido",
      "timeout_error": "Tiempo de conexión agotado",
      "invalid_format": "Formato inválido",
      "storage_full": "Espacio de almacenamiento insuficiente"
    }
  }
}